{
  "shortIntro": [
    "This project tackles the implications of integrating AI into organizations; how can it be used, what are the ethical issues, and how can we avoid making unfair decisions. This year I took an elective on Organizational Behavior (OB), which analyzes the behavior within organizations to provide a toolbox for organizational interaction. Studying OB has opened my eyes to how involved machine learning can be to optimize processes in organizations, but it has also brought me to deeply think about the moral implications of such integration. Machine learning is a field that has been almost exponentially expanding in the past few years, and it is a very lucrative technology for organizations to implement in order to optimize their workflow. In this project I have decided to analyze a dataset I found regarding factors contributing to employee turnover to demonstrate such implications."
  ],
  "longIntro": [
    "Machine learning has definitely become of the biggest concepts and buzzwords in the tech industry in the past 5 years. To put some value to words, Stanford University's 2019 AI Index states that out of the organizations they have researched, over 85% think that Machine Learning integration will improve performance and will be required to optimize cost reduction. Indeed's job reports show that the demand for machine learning jobs in organizations has grown by 344% in 2019. The number of research papers regarding Machine Learning has more than tripled in the past two years. Safe to say, Machine learning will be a big part of the near tech future",
    "I started my journey of learning Machine Learning a few years ago when I started engineering at University, mainly because I was interested to see what I can do with it. As a learner, I noticed you can start implementing algorithms without really understanding the underlying functionality using some existing frameworks that do most of the work for you.  It is indeed a very powerful tool, that is applicable to a lot of fields, even outside of technology and it can be used in extremely devious applications.",
    "It's not hard to connect the dots. An extremely popular concept, that is very accessible to learn and high in demand by companies; someone is going to use it maliciously. Ethics in AI has been a rising topic in Machine Learning in the past few years, but it still has a long way to develop. Some companies have taken initiative such as IBM ceasing to offer Facial Recognition software, the EU published a charter for the ethical use of AI, etc. It is important to point out that Stanford's published AI index stated that the three top concerns for ethics in AI are: Fairness, Interpretability, and Explainability. Whilst studying Engineering in university, there is an immense focus on ethics regarding the environment and people when applying the concepts we learn in engineering. Every project we worked on required a detailed analysis of the societal and environmental impact. As boring as they were to write, it really engraved it in my mind to analyze the ethics of any solution I come up with for an engineering problem. This focus on ethics was not echoed as much in my learning journey for AI. Maybe, I didn't look in the right places, but I think it really shouldn't be something I look for when learning such a powerful topic. Luckily, I am able to use the engineering mindset I acquired for also thinking about machine learning problems. I am aware though that a lot of people might not have had the opportunity to acquire this ethics mindset prior to starting their machine learning journey, which I think leaves a substantial gap in their learning. A big part of that gap that I have noticed is learning that the quality of your solution doesn't just depend on your results, but it depends also on the consequences of these results when applied to the real world",
    "This year, I took a course in Organizational Behavior (OB) which focuses on the systematic study and application of knowledge of how people interact within their organizations. One of the pillars of OB describes companies as systems that have inputs and corresponding outputs. Companies are continuously trying to find the relationship between their inputs and outputs to optimize their performance. Another pillar is research, and companies have been focusing on using rigorous research to analyze the behaviors of people that are part of its organization. It is obvious that there is a lot of room for machine learning in OB. One recurring theme I notice in Organizational Behavior is the idea that treating employees decently generally positively correlates with better performance. This brings me to think, what is the juxtaposition of companies treating employees well just because research shows that it will result in better output and companies treating employees well because it is the ethical thing to do? What if research proved the contrary, where do companies draw the line between ethics and profit? As an employee, this question makes me worry which what really motivated me to start this little project. Machine learning has a lot of potential in providing tools for research in OB, but it can have detrimental results depending on how organizations decide to use these results. ",
    "In the past decade, companies have been putting more focus on ethics and human rights in the workplace. However, in my opinion,  AI is a completely different beast. How do you put an ethical leash on something that is inherently biased, and not interpretable by most people (also often not even explainable by developers who use the models)? One quirk with AI and ethics is that it resonates with the reality of whatever you train it on, which in most cases involved a good side and bad side. This finally brings me to the topic of this project. I wanted to demonstrate that the usage of AI/Machine Learning in organizations will often expose various types of results. "
  ],
  "data": [
    "The dataset used was created to analyze employee turnover. It includes a bunch of factors such as job satisfaction, performance, age, etc that employees and managers were surveyed on. The aim of the analysis is to draw conclusions on what factors lead employees to leave or stay. The data surveyed around 4500 employees which is a relatively small dataset, but it was the highest quality one I found with minimum effort.",
    "The data is publicly available and under the Open Commons open database license. The data was grabbed from Kaggle (https://www.kaggle.com/patelprashant/employee-attrition).  I did not create, nor participate in the surveys concluded in this dataset."
  ],
  "model": [
    "I created a machine learning model that given some information about the employee (ie the survey features explained earlier), can predict whether an employee will stay or not. The model has an accuracy of 87%, which is not amazing but the purpose of the model for this project is just to be good enough, although 87% accuracy is actually decent given the size of the dataset. My model was a binary classifier, meaning when fed information about an employee, it has a Yes or No output prediction for that employee's turnover. One of the main reasons I chose this model is that it allows us to see how the algorithm weighs the various features with relation to turnover.  ",
    "I won't be spending too much time on the technicalities and inner workings of the model because it is not the main focus of this article. For the tech-savvy out there, I experimented with a bunch of techniques; SVM's, a Neural Network with a various number of hidden layers, and logistic regression. I ended up spending some time tuning a logistic regression model because it gave the highest accuracy, and I wanted to take advantage of the coefficient values to interpret the importance of different features relating to turnover."
  ],
  "dashboard": [
    "I created an interactive dashboard that helps us interpret some of the results outputted by the model. The purpose of this dashboard is two things. Firstly, it allows anyone to explore the data as they wish. There are a few interactions I have created. Each figure in the chart is labeled and has a 'Detailed Info' button that explains its purpose. Secondly, instead of copy and pasting charts all over, anything result I reference can be double-checked through the interactions in the chart. The interactions are pretty straight forward."
  ],
  "good": [
    "This model could definitely be used for a good cause. If you are an organization that has been suffering from a lot of turnover and want to address that issue or you are an organization that wants to retain its high performing employees, this use of machine learning can really help. Using the tools in the dashboard, it is fairly simple to start locating areas that you can work on.",
    "Using Figure 1,  you can see that the model suggests that the most prominent factor behind employees leaving is a promotion issue. As an organization, you might want to put some focus on planning how to integrate more promotions to retain your employees. Another noticeable thing is that certain departments have different weightings for turnover as well. The results show employees doing research are likely to leave versus other departments like marketing. Obviously, some factors are not controllable but the model still weighs, such as being single, divorced, etc. There are some other interesting results I noticed while exploring the data. For example, using the variable correlator, I noticed that being a male positively correlates with turnover, contrary to being a female which negatively correlates with turnover. I would like to point out this is not the model being biased. The model essentially reflects the reality of the data it uses so if there is bias in turnover, that reality will be reflected in the model when it is trained. In this case, we can use the subtle biases that the model catches to actually inform ourselves that we have a certain group of people within the organization that is more likely to leave, which is I would assume is undesirable."
  ],
  "bad": [
    "There are honestly lots of unethical ways this model could be used. The most devious way I think this could be used is for organizations to incentivize employees to leave in order to cut down on business costs by not having to pay for extra costs such as termination pay. An organization might want to continuously hire new talent, but that means getting rid of existing employees, and instead of layoffs, they can use this machine learning modeling technique to induce turnover for certain employees. This could really cut down costs on termination pay for the company and gives them more financial liberty to pay their new talent well. In the past couple of decades, forced retirement has become illegal in a lot of countries around the world to protect employees. Since then, companies have developed 'voluntary retirement' programs to instead approach induced retirement. The usage of this machine learning model can bring back forced retirement in a very implicit manner that is legal, which should be highly concerning.",
    "This could be easily demonstrated with an example from this project. Let's assume that you're an employee who's 6 years away from retirement or you no longer fit the company and therefore the company wants you to leave. The company can use the results from this dashboard, and try to modify the features until the machine learning model predicts that you are highly likely to leave by yourself then start implementing those modifications in real life. They start switching your manager very often, making you travel more frequently, switch you to a research department, and put pressure on your work-life balance. That way, they predict that in three years, with these new modifications in place, you'll leave by yourself. In the law's eyes, this is perfectly legal in a lot of places. The reality is, this is completely unduly and immoral towards employees."
  ],
  "conclusion": [
    "This project has demonstrated that Machine learning is a double-edged sword, and both edges are very sharp. My experimentation has shown that AI has a lot of potential to boost research in organizational behavior, but it has also demonstrated the menacing outcomes if the research is used unethically. I think that without question there is an immense need for more discussion and regulation of ethics in machine learning. I have clearly demonstrated how using machine learning can allow companies to perform dishonorable actions that are perfectly legal that can help optimize their costs. What I've done here is an extremely small scale example of what could be done. One can only imagine what companies can do with dedicated teams and way more resources. We have already seen some of the detrimental results of the misuse of AI in cases such as the Cambridge Analytica and Facebook scandal, and this was four years ago.",
    "I hope whoever reads this is convinced of the message I am trying to send and shares the same concerns I have I have for a future that will involve a lot of Machine learning technology in the organizations that we are part of. The Machine learning community is starting to put a lot of focus on ethics in AI, and it is promising and somewhat relieving to see. However, we still have to make more substantial strides towards this effort to really make change and also protect the future of AI. If you have made it this far, thanks for reading, appreciate it a lot. If you have any concerns or questions or wanna chat, feel free to reach out with the info I put above."
  ],
  "md1": [
    "This figure displays the top 20 contributing factors to turnover in the dataset. The y-axis represents the relative importance of the feature when the model is making a prediction. Features with a high absolute value have higher impact on turnover. The negative features are the turnover inducing features and vice versa."
  ],
  "md2": [
    "This chart displays the correlation between any two features in the dataset. The gauge and number display will provide a visual representation of the correlation result. The dropdowns can be used to type or click on desired features"
  ],
  "md3": [
    "This figure gives the distribution plot for any feature in the dataset, you can use the drop down to type or click on desired features. "
  ],
  "md4": [
    "This figure is a pie chart that represents the top 10 positive or negative contributing features to turnover. You can use the clickable buttons to switch between the positive and negative display"
  ]

}